================================================================================
Standard cast
================================================================================

SELECT CAST(1 AS TEXT);

--------------------------------------------------------------------------------

(program
  (statement
    (select
      (keyword_select)
      (select_expression
        (term
          (cast
            (keyword_cast)
            (literal)
            (keyword_as)
            (keyword_text)))))))

================================================================================
Aliased
================================================================================

SELECT CAST(1 AS TEXT) AS fieldname;

--------------------------------------------------------------------------------

(program
  (statement
    (select
      (keyword_select)
      (select_expression
        (term
          value: (cast
            name: (keyword_cast)
            parameter: (literal)
            (keyword_as)
            (keyword_text))
          (keyword_as)
          alias: (identifier))))))

================================================================================
teradata shorthand
================================================================================

SELECT
  1(varchar(100)),
  1(integer)

--------------------------------------------------------------------------------
    (program
      (statement
        (select
          (keyword_select)
          (select_expression
            (term
              (cast
                (literal)
                (varchar
                  (keyword_varchar)
                  (literal))))
            (term
              (cast
                (literal)
                (int
                  (keyword_int))))))))

================================================================================
Multiple casts
================================================================================

SELECT
  CAST ('100' AS INTEGER),
  '100'(INTEGER),
  '01-OCT-2015'(DATE)

--------------------------------------------------------------------------------
    (program
      (statement
        (select
          (keyword_select)
          (select_expression
            (term
              (cast
                (keyword_cast)
                (literal)
                (keyword_as)
                (int
                  (keyword_int))))
            (term
              (cast
                (literal)
                (int
                  (keyword_int))))
            (term
              (cast
                (literal)
                (keyword_date)))))))

================================================================================
Casts /w precision
================================================================================

SELECT
CAST (100 AS NUMERIC(32)),
     100(FLOAT),
     100(FLOAT);

--------------------------------------------------------------------------------
    (program
      (statement
        (select
          (keyword_select)
          (select_expression
            (term
              (cast
                (keyword_cast)
                (literal)
                (keyword_as)
                (numeric
                  (keyword_numeric)
                  (literal))))
            (term
              (cast
                (literal)
                (float
                  (keyword_float))))
            (term
              (cast
                (literal)
                (float
                  (keyword_float))))))))

================================================================================
SELECT AS UNSIGNED
================================================================================

SELECT CAST ("1" AS UNSIGNED INTEGER);

--------------------------------------------------------------------------------

(program
  (statement
    (select
      (keyword_select)
      (select_expression
        (term
          value: (cast
            name: (keyword_cast)
            parameter: (literal)
            (keyword_as)
            (int
              (keyword_unsigned)
              (keyword_int))))))))

================================================================================
Cast intervals
================================================================================

SELECT '1 day 10 seconds'(INTERVAL), CAST('1 month' AS INTERVAL)

--------------------------------------------------------------------------------

(program
  (statement
    (select
      (keyword_select)
      (select_expression
        (term
          value: (cast
            (literal)
            (keyword_interval)))
        (term
          value: (cast
            name: (keyword_cast)
            parameter: (literal)
            (keyword_as)
            (keyword_interval)))))))

================================================================================
Cast interval with temporal qualifier
================================================================================

SELECT (ts1 - ts2) DAY(4) TO SECOND
from db.table1
;

--------------------------------------------------------------------------------

    (program
      (statement
        (select
          (keyword_select)
          (select_expression
            (term
              (parenthesized_expression
                (binary_expression
                  (field
                    (identifier))
                  (field
                    (identifier))))
              (keyword_day)
              (keyword_to)
              (keyword_second))))
        (from
          (keyword_from)
          (relation
            (object_reference
              (identifier)
              (identifier))))))

================================================================================
Explicit cast with format only
================================================================================

SELECT cast(dt as format 'YYYYMMDD')
from db.table1
;

--------------------------------------------------------------------------------

    (program
      (statement
        (select
          (keyword_select)
          (select_expression
            (term
              (cast
                (keyword_cast)
                (field
                  (identifier))
                (keyword_as)
                (format
                  (keyword_format))))))
        (from
          (keyword_from)
          (relation
            (object_reference
              (identifier)
              (identifier))))))
