================================================================================
macro
================================================================================

show macro db.macro1;

--------------------------------------------------------------------------------
    (program
      (statement
        (keyword_show)
        (keyword_macro)
        (object_reference
          (identifier)
          (identifier))))

================================================================================
view
================================================================================

show view db.view1;

--------------------------------------------------------------------------------

    (program
      (statement
        (keyword_show)
        (keyword_view)
        (object_reference
          (identifier)
          (identifier))))
================================================================================
table
================================================================================

show table db.table1;
--------------------------------------------------------------------------------

    (program
      (statement
        (keyword_show)
        (keyword_table)
        (object_reference
          (identifier)
          (identifier))))



================================================================================
stats
================================================================================

show stats on b.table1;
--------------------------------------------------------------------------------

    (program
      (statement
        (keyword_show)
        (keyword_stats)
        (keyword_on)
        (object_reference
          (identifier)
          (identifier))))



